IDEA Open Model
ConnectionPoint.NodeId Property
Compatible with IDEA StatiCa Beta 20.0
Note: This API is now obsolete.
 Id of node
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[ObsoleteAttribute("Use the Node reference element.")]
public int NodeId { get; set; }
<ObsoleteAttribute("Use the Node reference element.")>
Public Property NodeId As Integer
	Get
	Set
Property Value
Type: Int32
Remarks
 This property is not longer supported. Use the Node property instead of this one.
See Also
Reference
ConnectionPoint Class
IdeaRS.OpenModel.Connection Namespace